export { LyricsPlayer }
let text  = '"[ti&#58;年少有为]&#10;[ar&#58;李荣浩]&#10;[al&#58;耳朵]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;47]年少有为&#32;&#45;&#32;李荣浩&#10;[00&#58;01&#46;17]词：李荣浩&#10;[00&#58;01&#46;30]曲：李荣浩&#10;[00&#58;01&#46;43]制作人Producer：李荣浩Ronghao&#32;Li&#10;[00&#58;01&#46;73]编曲Arrangement：李荣浩Ronghao&#32;Li&#10;[00&#58;01&#46;99]吉他Guitars：李荣浩Ronghao&#32;Li&#10;[00&#58;02&#46;26]贝斯Bass：李荣浩Ronghao&#32;Li&#10;[00&#58;02&#46;52]鼓Drums：Alex&#10;[00&#58;02&#46;62]和声编写Backing&#32;Vocal&#32;Arrangement：李荣浩Ronghao&#32;Li&#10;[00&#58;03&#46;02]和声Backing&#32;Vocal：李荣浩Ronghao&#32;Li&#10;[00&#58;03&#46;32]弦乐编写Strings&#32;Arrangement：李荣浩Ronghao&#32;Li&#10;[00&#58;03&#46;68]弦乐Strings：国际首席爱乐乐团International&#32;Master&#32;Philharmonic&#32;Orchestra&#10;[00&#58;04&#46;17]录音师Recording&#32;Engineer：李荣浩Ronghao&#32;Li&#10;[00&#58;04&#46;50]混音师Mixing&#32;Engineer：李荣浩Ronghao&#32;Li&#10;[00&#58;04&#46;83]录音室Recording&#32;Studio：北京一样音乐录音室Beijing&#32;Young&#32;Music&#32;Studio&#10;[00&#58;05&#46;43]混音室Mixing&#32;Studio：北京一样音乐录音室Beijing&#32;Young&#32;Music&#32;Studio&#10;[00&#58;06&#46;02]母带后期制作人Mastering&#32;Producer：李荣浩Ronghao&#32;Li&#10;[00&#58;06&#46;48]母带后期处理工程师Mastering&#32;Engineer：周天澈TC&#32;Z&#46;&#10;[00&#58;07&#46;01]母带后期处理录音室Mastering&#32;Studio：TC&#32;Faders&#10;[00&#58;07&#46;44]OP：一样音乐工作室&#10;[00&#58;07&#46;70]SP：酷亚音乐&#32;&#40;深圳&#41;有限公司&#32;admin&#32;by&#32;One&#32;Asia&#32;Music&#32;Inc&#46;&#32;酷亚音乐股份有限公司&#10;[00&#58;29&#46;92]电视一直闪&#10;[00&#58;33&#46;57]联络方式都还没删&#10;[00&#58;37&#46;31]你待我的好&#10;[00&#58;40&#46;92]我却错手毁掉&#10;[00&#58;44&#46;58]也曾一起想&#10;[00&#58;48&#46;20]有个地方睡觉吃饭&#10;[00&#58;51&#46;82]可怎么去熬&#10;[00&#58;53&#46;81]日夜颠倒连头款也凑不到&#10;[00&#58;59&#46;30]墙板&#32;被我砸烂&#10;[01&#58;02&#46;77]到现在还没修&#10;[01&#58;06&#46;07]一碗热的粥&#10;[01&#58;08&#46;18]你怕我没够&#10;[01&#58;10&#46;00]都留一半带走&#10;[01&#58;12&#46;81]给你形容&#10;[01&#58;15&#46;42]美好今后你常常眼睛会红&#10;[01&#58;20&#46;54]原来心疼我&#32;我那时候不懂&#10;[01&#58;27&#46;43]假如我年少有为不自卑&#10;[01&#58;31&#46;81]懂得什么是珍贵&#10;[01&#58;34&#46;20]那些美梦&#10;[01&#58;37&#46;86]没给你&#32;我一生有愧&#10;[01&#58;41&#46;97]假如我年少有为&#32;知进退&#10;[01&#58;46&#46;26]才不会让你替我受罪&#10;[01&#58;50&#46;15]婚礼上&#32;多喝几杯&#10;[01&#58;53&#46;36]和你现在那位&#10;[02&#58;26&#46;33]也曾一起想&#10;[02&#58;29&#46;96]有个地方睡觉吃饭&#10;[02&#58;33&#46;61]可怎么去熬&#10;[02&#58;35&#46;57]日夜颠倒连头款也凑不到&#10;[02&#58;41&#46;15]墙板&#32;被我砸烂&#10;[02&#58;44&#46;57]到现在还没修&#10;[02&#58;47&#46;85]一碗热的粥&#10;[02&#58;49&#46;92]你怕我没够&#10;[02&#58;51&#46;83]都留一半带走&#10;[02&#58;54&#46;57]给你形容&#10;[02&#58;57&#46;28]美好今后你常常眼睛会红&#10;[03&#58;02&#46;37]原来心疼我&#32;我那时候不懂&#10;[03&#58;09&#46;26]假如我年少有为不自卑&#10;[03&#58;13&#46;55]懂得什么是珍贵&#10;[03&#58;16&#46;02]那些美梦&#10;[03&#58;19&#46;67]没给你&#32;我一生有愧&#10;[03&#58;23&#46;72]假如我年少有为&#32;知进退&#10;[03&#58;28&#46;12]才不会让你替我受罪&#10;[03&#58;32&#46;01]婚礼上&#32;多喝几杯&#10;[03&#58;35&#46;09]和你现在那位&#10;[03&#58;41&#46;94]假如我年少有为不自卑&#10;[03&#58;46&#46;23]尝过后悔的滋味&#10;[03&#58;48&#46;76]金钱地位&#10;[03&#58;52&#46;40]搏到了却好想退回&#10;[03&#58;56&#46;42]假如我年少有为&#32;知进退&#10;[04&#58;00&#46;84]才不会让你替我受罪&#10;[04&#58;04&#46;70]婚礼上&#32;多喝几杯&#10;[04&#58;07&#46;81]和你现在那位&#10;[04&#58;15&#46;30]在婚礼上&#32;多喝几杯&#10;[04&#58;18&#46;79]祝我年少有为"'
class LyricsPlayer {
  constructor(el) {
    this.$el = el
    this.$el.innerHTML = `<div class='player-lyrics-lines'></div>`
    this.$lines = this.$el.querySelector('.player-lyrics-lines')
    this.text = ''
    this.index = 0
    this.elapsed = 0
    this.lyrics = []
    this.reset(this.text)
  }
  pause() {

  }
  start() {

  }
  update() {

  }
  render() {
    let html = this.lyrics.map(line => `
      <div class='player-lyrics-line'>${line.slice(10)}</div>
    `).join('')
    this.$lines.innerHTML = html
  }
  reset(text) {
    this.pause()
    this.index = 0
    this.elapsed = 0
    if (text) {
      this.text = this.formatText(text) || ''
      this.lyrics = this.text.match(/^\[\d{2}:\d{2}\.\d{2}\](.+)$/gm)
      if (this.lyrics.length) {
        this.render()
        this.$lines.children[this.index].classList.add('active')
      }
    }
  }
  formatText(text) {
    let div = document.createElement('div')
    div.innerText = text
    return div.innerText
  }
}